# FabricationPartCannotChangeTypeUnConnError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..FabricationPartCannotChangeTypeUnConnError Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
The selected fitting(s) cannot successfully change the type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FabricationPartCannotChangeTypeUnConnError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationPartCannotChangeTypeUnConnError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FabricationPartCannotChangeTypeUnConnError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace